Revit 2026 API

# BeamSystemCreate(Document, IListCurve, SketchPlane, Int32) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BeamSystem Create(
	Document document,
	IList<Curve> profile,
	SketchPlane sketchPlane,
	int curveIndexForDirection
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of Curve),
	sketchPlane As SketchPlane,
	curveIndexForDirection As Integer
) As BeamSystem
```
```cpp
public:
static BeamSystem^ Create(
	Document^ document,
	IList<Curve^>^ profile,
	SketchPlane^ sketchPlane,
	int curveIndexForDirection
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<Curve> *
        sketchPlane : SketchPlane *
        curveIndexForDirection : int -> BeamSystem
```

#### Parameters

document Document

profile IListCurve

sketchPlane SketchPlane

curveIndexForDirection Int32

#### Return Value

BeamSystem

#### Reference

BeamSystem Class

Create Overload

Autodesk.Revit.DB Namespace